{"id":51,"date":"2020-10-05T05:43:24","date_gmt":"2020-10-05T05:43:24","guid":{"rendered":"https:\/\/meticoreindustries.com\/?page_id=51"},"modified":"2020-10-12T06:51:06","modified_gmt":"2020-10-12T06:51:06","slug":"digistore24-terms","status":"publish","type":"page","link":"https:\/\/www.meticoreindustries.com\/digistore24-terms\/","title":{"rendered":"Digistore24 Terms"},"content":{"rendered":"\n<p>Effective as March 2019.<\/p>\n\n\n\n<p>**IMPORTANT – These Standard Business Terms for Digistore24 Buyers (hereinafter referred to as the “Standard Business Terms”) are a legal agreement between each individual person or entity (referenced herein as a “buyer”) and Digistore24 Inc. (hereinafter referred to as “we” or “Digistore24” or with “us”) that applies each time a buyer uses the Digistore24.com site and its available functionality (referenced herein as the “Online Platform”) or purchases a good or service from the Online Platform. Each buyer should therefore read carefully the following terms and conditions contained in these Standard Business Terms as they govern use of the Online Platform and available purchases therefrom. **<\/p>\n\n\n\n<h2>1. General Terms<\/h2>\n\n\n\n<p>By accessing or using the Online Platform, buyer represents and warrants that buyer is at least 18 years of age (or the legal age of majority, whichever is greater) and will, at all times, provide true, accurate, current, and complete information when submitting information or materials on or through the Online Platform. In addition, buyer agrees to abide by all applicable local, state, national, and international laws and regulations with respect to buyer’s use of the Online Platform or the utilization of any available product or service.<\/p>\n\n\n\n<p>The Online Platform is owned by Digistore24 Inc. Copyright 2018 © Digistore24 Inc. and\/or its licensors. All rights reserved. DIGISTORE24, the Digistore24 logo, and all other names, logos, and icons identifying Digistore24 and its software, solutions, products, and services are proprietary trademarks of Digistore24, and any use of such marks without the express written permission of Digistore24 is strictly prohibited. Other service, product, or company names mentioned herein may be the trademarks and\/or service marks of their respective owners.<\/p>\n\n\n\n<h2>2. Performance by DigiStore24<\/h2>\n\n\n\n<p>The Online Platform is made available by Digistore24, and these Standard Business Terms provide to buyer a personal, revocable, limited, non-exclusive, non-transferable, and non-sublicensable license to use the Online Platform in order to review information and purchase available products or services. Digistore24 reserves all rights not expressly granted by these Standard Business Terms. Accordingly, buyer may not modify, translate, decompile, create derivative work(s) of, copy, distribute, disassemble, broadcast, transmit, publish, remove, or alter any proprietary notices or labels, license, sublicense, transfer, sell, mirror, frame, exploit, rent, lease, private label, grant a security interest in, or otherwise use in any manner not expressly permitted herein the Online Platform.<\/p>\n\n\n\n<p>Buyer has the ability to purchase a variety of products or services via the Online Platform. These may include new or pre-owned products. In addition, Digistore24 offers the opportunity to purchase subscriptions that may also offer products or the rendering of services. We may sell products and services both under our own brand and with and from dealers and service providers (hereinafter referred to as “contractual partners”) who, once a buyer makes a purchase via Digistore24, provide directly the relevant goods or services to buyer. Accordingly, the products or services concerned are sometimes provided by our contractual partners (whose logo appears during the ordering process). Buyer’s relationship is solely between buyer and the contractual partner. The availability of a contractual partner’s products or services through the Online Platform does not indicate our affiliation with the contractual partner or an endorsement of the contractual partner’s product or services. Statements, opinions, or claims made by contractual partners on the Online Platform do not necessarily reflect the views of Digistore24. They are solely made available for buyer’s informational purposes.<\/p>\n\n\n\n<p>Please note that third party dealers and service providers may include supplemental product- or service-specific terms governing use, pricing, or subscription and which shall apply in addition to these Standard Business Terms.<\/p>\n\n\n\n<p>Buyer will receive notification on a timely basis and in an appropriate manner if such product-specific (additional) terms are intended to apply and an appropriate opportunity to acknowledge them either as a part of agreeing to these Standard Business Terms or separately (and in addition to) these Standard Business Terms.<\/p>\n\n\n\n<h2>3. Purchase Process<\/h2>\n\n\n\n<p>Placing a product, service, or subscription opportunity in the online shop does not represent a binding offer on the part of Digistore24 to conclude a purchase agreement with buyer. In order to complete a purchase, buyer must place the desired merchandise into the cart and then enter the order data into the order form. After selecting the shipping option and the desired payment form, and formally accepting these Terms of Use, buyer then submits a binding offer by clicking the “Buy now” button. Following the order process, buyer will receive an order confirmation from Digistore24 by email.<\/p>\n\n\n\n<p>Digistore24 saves the contract text for the order and buyer may print it out before sending the order to us by clicking on “Print” during the final step of the order process. We also send buyer an order confirmation and an order acceptance containing all information concerning the order to the email address indicated by buyer.<\/p>\n\n\n\n<p>Acceptance on the part of Digistore24 is indicated either at the time of offer submission or by means of an explicit declaration of acceptance sent by email to buyer by the end of the third business day following the day of the order at the latest or by sending the contractual goods.<\/p>\n\n\n\n<p>Digistore24 is entitled to reject contract offers without need to state the reason(s).<\/p>\n\n\n\n<p>Offers by Digistore24 are non-binding and subject to change.<\/p>\n\n\n\n<h2>4. Software<\/h2>\n\n\n\n<p>In the event that a product offers use of software, such software is provided subject to the respective license terms and conditions, which (as noted above) are in addition to these Standard Business Terms.<\/p>\n\n\n\n<p>Regardless, such software may not be used except as expressly permitted by the respective license terms and conditions and in general, may not otherwise be duplicated, adapted, translated, made available, distributed, modified, disassembled, decompiled, re-translated, or combined with other software.<\/p>\n\n\n\n<h2>5. Prices<\/h2>\n\n\n\n<p>The prices in effect at the time an order is placed are those that are applicable to such order. All prices are indicated in USD and are understood to include VAT and applicable sales tax depending on location.<\/p>\n\n\n\n<p>The prices do not include shipping or delivery costs; such costs will be stated separately during the ordering process. Applicable fee(s) or price(s), including the purchase price and shipping charges, is immediately due for payment.<\/p>\n\n\n\n<p>Amounts due for payment by buyer will be identified on the order form.<\/p>\n\n\n\n<h2>6. Payment terms<\/h2>\n\n\n\n<p>Digistore24 offers buyers different payment method options. Currently, these are: PayPal, payment by MasterCard, Visa, Discover, and American Express credit cards, electronic direct debit, instant bank transfer, or bank transfer.<\/p>\n\n\n\n<p>If buyer acquires a product in connection with a subscription (“subscription product”), or a product or service that includes partial payments, using the Digistore24 order form, the transaction is deemed to include the grant of a direct debit mandate to us by buyer. The amount of payments to be made is based on the product purchased or service ordered. In such cases, the direct debit mandate applies to the relevant payment method.<\/p>\n\n\n\n<p>Subject to the terms and conditions set forth herein, applicable refunds will be provided using the same payment method selected in connection with the original transaction. In the event of the grant of a SEPA direct debit mandate, the concurrent reversal of payment by buyer is thus not necessary. We are entitled to demand disclosure of the account holder’s personal information from the institution maintaining buyer’s account for purposes of enforcing our claims under applicable law should buyer, following the expiry of a reasonable period granted by us, not repay the amount wrongfully obtained following a reversal of payment and concurrent refund by us. Furthermore, we reserve the right to file a criminal complaint in such cases.<\/p>\n\n\n\n<h2>7. Refund<\/h2>\n\n\n\n<p>Buyers will have the following refund rights:<\/p>\n\n\n\n<h3>Refund Policy for the Supply of Goods:<\/h3>\n\n\n\n<p>Each buyer will have the right to return tangible goods purchased through the Online Platform for a refund, subject to the terms and conditions below.<\/p>\n\n\n\n<p>In order to exercise this right, a buyer must, within 60 days (unless otherwise indicated) from the date the buyer places the corresponding order through the Online Platform, inform Digistore24 (DigiStore24 Inc, 360 Central Avenue, Suite 800, St. Petersburg, FL 33701, United States, Email: helpdesk@digistore24.com) of buyer’s decision to return the purchase by means of a clear declaration (e.g., in a letter sent by mail, fax, or email).<\/p>\n\n\n\n<p>Subject to the terms, conditions, and restrictions set forth herein, we will refund payments received for the goods, no later than 14 days from (in our discretion) the date we receive the returned goods or the date we receive proof that the buyer has returned the goods. For this refund, we will use the same means of payment which buyer used for the original transaction unless otherwise expressly agreed with buyer.<\/p>\n\n\n\n<p>We will bear the shipping costs of returning the goods. However, buyer is responsible for the cost of any deterioration of the goods, i.e., deterioration caused by handling or that otherwise impacts the quality, features, or functioning of the goods. We reserve the right to deduct payments from the refund amount accordingly.<\/p>\n\n\n\n<p>There is no right of refund (i) in the case of distance contracts for the supply of goods that are not prefabricated and for which individual selection or specification by the consumer is decisive for their production or that are clearly tailored to the personal needs of the consumer, (ii) for the supply of magazines, newspapers, or journals with the exception of subscription contracts, (iii) for distance contracts for the supply of sealed goods which are not suitable for return due to health protection or hygiene reasons and were unsealed after delivery, (iv) for distance contracts for the supply of goods which, according to their nature, were inseparably mixed with other goods after delivery, or (v) for distance contracts for the supply of audio or video recordings or computer software in sealed packaging which were unsealed after delivery.<\/p>\n\n\n\n<h3>Refund for the Supply of Digital Content:<\/h3>\n\n\n\n<p>We may provide a refund for digital content at our discretion. To request a refund, buyer must, within 60 days (unless otherwise indicated) of purchase, submit a refund request to DigiStore24 (DigiStore24 Inc, 360 Central Avenue, Suite 800, St. Petersburg, FL 33701, United States, Email: helpdesk@Digistore24.com) expressly stating the reason for the refund request.<\/p>\n\n\n\n<p>In the event the digital content has been corrupted or does not perform as prescribed, we may offer buyer the opportunity to re-download the digital content. If a refund is issued, buyer is no longer allowed to access or otherwise use the digital content and must delete the digital content from buyer’s device. Digistore24 reserves the right to remove buyer’s access to digital content once a refund has been issued.<\/p>\n\n\n\n<h3>Refund for Rendering Services:<\/h3>\n\n\n\n<p>We may provide a refund for services at our discretion. To request a refund, a buyer must, within 60 days (unless otherwise indicated) of purchase, submit a refund request to DigiStore24 (DigiStore24 Inc, 360 Central Avenue, Suite 800, St. Petersburg, FL 33701, United States, Email: helpdesk@Digistore24.com) expressly stating the reason for the request (e.g., buyer was not satisfied with the services provided). In the event a refund is issued, any ongoing services subject to such refund shall immediately cease.<\/p>\n\n\n\n<h2>8. Delivery and Delivery Time<\/h2>\n\n\n\n<p>For any purchase of goods, shipments will generally be made within 10 days of receipt of funds in Digistore24’s account.<\/p>\n\n\n\n<p>Partial deliveries are permitted and may be invoiced separately to an extent that is reasonably acceptable to buyer.<\/p>\n\n\n\n<h2>9. Passage of Risk<\/h2>\n\n\n\n<p>Risk of loss passes to buyer as soon as the shipment is transferred to the carrier or has left the warehouse or that of a subcontractor. If shipment is delayed at the request of buyer, risk passes to buyer upon notice of readiness for shipment.<\/p>\n\n\n\n<h2>10. Retention of Title<\/h2>\n\n\n\n<p>Title to the goods transfers upon payment in full. Prior to the transfer of ownership, the following are prohibited without the consent of Digistore24: pledge, transfer of a security interest, processing, or modification.<\/p>\n\n\n\n<h2>11. Warranty<\/h2>\n\n\n\n<p>Unless otherwise noted or as limited by applicable law, all goods and services are provided AS-IS and AS-AVAILABLE. Any available warranty for a product or service shall be provided with the purchase of the goods or service. In making a warranty claim, and as applicable, buyer is required to provide notice of all visible defects upon receipt of the goods or within 5 business days at the latest. Latent defects that could also not have been located in the course of an immediate inspection may only be claimed toward Digistore24 if we receive notice of the defect within six months of the goods leaving the supplier. In the case of legitimate complaints, Digistore24 is obliged, at its discretion, to effect a cure or make a replacement delivery. The warranty rights lapse if buyer does not provide us the opportunity to inspect or buyer does not immediately make the allegedly defective goods or a sample thereof available upon request. Objections related to partial deliveries do not entitle buyer to reject the remainder of the delivery. There may also be no warranty rights in the case of pre-owned products.<\/p>\n\n\n\n<h2>12. Limitation on Liability<\/h2>\n\n\n\n<p>The Online Platform is provided AS-IS and AS-AVAILABLE. Access to the Online Platform may be interrupted or limited on an occasional basis in order to perform repairs, maintenance, or to install new equipment. FURTHER, TO THE EXTENT PRODUCTS AND GOODS PURCHASED THROUGH THE ONLINE PLATFORM ARE PROVIDED BY THIRD PARTY SELLERS OR ARE OTHERWISE MANUFACTURED OR SOLD BY THIRD PARTIES, DIGISTORE24 DISCLAIMS ALL LIABILITY WITH RESPECT TO SUCH THIRD PARTY PRODUCTS AND GOODS. TO THE FULLEST EXTENT PROVIDED BY LAW, DIGISTORE24 EXPRESSLY DISCLAIMS ALL OTHER WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT, NOT EXPRESSLY SET FORTH HEREIN.<\/p>\n\n\n\n<p>IN NO EVENT SHALL DIGISTORE24 BE LIABLE FOR ANY INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OF THIRD PARTY PRODUCTS OR GOODS AND THE ONLINE PLATFORM OR WITH THE DELAY OR INABILITY TO USE THE ONLINE PLATFORM, EVEN IF DIGISTORE24 HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.<\/p>\n\n\n\n<p>Buyer is required to indemnify and hold Digistore24 harmless in relation to any breach of these Standard Business Terms by buyer.<\/p>\n\n\n\n<h2>13. Online Dispute Resolution<\/h2>\n\n\n\n<p>If a legal citizen of a country within the European Union, the European Commission has made an online dispute resolution available (“ODR”). Buyer may access the platform at http:\/\/ec.europa.eu\/consumers\/odr.<\/p>\n\n\n\n<h2>14. Place of Performance; Jurisdiction; Applicable Law<\/h2>\n\n\n\n<p>These Standard Business Terms are governed and construed in accordance with the laws of the State of Florida, USA. The exclusive place of jurisdiction for all disputes arising under, or in connection with, the Standard Business Terms is the State of Florida, USA.<\/p>\n\n\n\n<p>United States law shall apply subject to the exclusion of the United Nations Convention on Contracts for the International Sale of Goods.<\/p>\n\n\n\n<p>Buyer may not use the Online Platform or any of Digistore24’s data, systems, network, or services to engage in, foster, or promote illegal, abusive, or irresponsible behavior. Digistore24 reserves the right to view, monitor, and record activity on the Online Platform without notice or permission from buyer. Any information obtained by monitoring, reviewing, or recording is subject to review by law enforcement organizations in connection with investigation or prosecution of possible criminal or unlawful activity on the Online Platform as well as to disclosures required by or under applicable law or related government agency actions. Digistore24 will also comply with all court orders or subpoenas involving requests for such information. In addition to the foregoing, Digistore24 reserves the right to, at any time and without notice, modify, update, suspend, terminate, or interrupt operation of or access to the Online Platform, or any portion of the Online Platform in order to protect the Online Platform or Digistore24.<\/p>\n\n\n\n<h2>15. Miscellaenous<\/h2>\n\n\n\n<p>Buyer and Digistore24 are independent contractors.<\/p>\n\n\n\n<p>Buyer is not entitled to assign rights under these Standard Business Terms to third parties absent our consent. Failure to insist on strict performance of any of these Standard Business Terms will not operate as a waiver of any subsequent default or failure of performance. No waiver by Digistore24 of any right under these Standard Business Terms will be deemed to be either a waiver of any other right or provision or a waiver of that same right or provision at any other time.<\/p>\n\n\n\n<p>If any part of these Standard Business Terms is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers, venue, claim, and liability limitations set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most clearly matches the intent of the original provision and the remainder of these Standard Business Terms shall continue in effect.<\/p>\n\n\n\n<p>These Standard Business Terms (and any supplemental terms applied with the purchase of a product, service or subscription) represent the entire agreement between buyer and Digistore24 with respect to use of the Online Platform and supersede all prior or contemporaneous communications and proposals, whether electronic, oral, or written between buyer and Digistore24 with respect to the Online Platform. Digistore24 also provides the available goods and services exclusively on the basis of these Standard Business Terms.<\/p>\n\n\n\n<p>Buyer may access additional information regarding our privacy policy at any time under&nbsp;<a href=\"https:\/\/www.digistore24.com\/page\/privacy\">https:\/\/www.digistore24.com\/page\/privacy<\/a>.<\/p>\n\n\n\n<h2>16. Contact Information<\/h2>\n\n\n\n<p>If a buyer has any questions regarding these Standard Business Terms or if a buyer is interested in obtaining more information concerning Digistore24 or this Online Platform or any available products, please contact Digistore24 at 360 Central Avenue, Suite 800 St. Petersburg, Florida 33701 USA, +1-800-745-7496 (phone), or helpdesk@digistore24.com (email).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Effective as March 2019. **IMPORTANT – These Standard Business Terms for Digistore24 Buyers (hereinafter referred to as the “Standard Business Terms”) are a legal agreement between each individual person or entity (referenced herein as a “buyer”) and Digistore24 Inc. (hereinafter referred to as “we” or “Digistore24” or with “us”) that applies each time a buyer &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.meticoreindustries.com\/digistore24-terms\/\"> <span class=\"screen-reader-text\">Digistore24 Terms<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Digistore24 Terms - Meticore<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.meticoreindustries.com\/digistore24-terms\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Digistore24 Terms - Meticore\" \/>\n<meta property=\"og:description\" content=\"Effective as March 2019. **IMPORTANT – These Standard Business Terms for Digistore24 Buyers (hereinafter referred to as the “Standard Business Terms”) are a legal agreement between each individual person or entity (referenced herein as a “buyer”) and Digistore24 Inc. (hereinafter referred to as “we” or “Digistore24” or with “us”) that applies each time a buyer &hellip; Digistore24 Terms Read More &raquo;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.meticoreindustries.com\/digistore24-terms\/\" \/>\n<meta property=\"og:site_name\" content=\"Meticore\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-12T06:51:06+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\">\n\t<meta name=\"twitter:data1\" content=\"admin\">\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data2\" content=\"12 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.meticoreindustries.com\/#website\",\"url\":\"https:\/\/www.meticoreindustries.com\/\",\"name\":\"Meticore\",\"description\":\"#1 Healthy Metabolism Support Formula\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.meticoreindustries.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.meticoreindustries.com\/digistore24-terms\/#webpage\",\"url\":\"https:\/\/www.meticoreindustries.com\/digistore24-terms\/\",\"name\":\"Digistore24 Terms - Meticore\",\"isPartOf\":{\"@id\":\"https:\/\/www.meticoreindustries.com\/#website\"},\"datePublished\":\"2020-10-05T05:43:24+00:00\",\"dateModified\":\"2020-10-12T06:51:06+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.meticoreindustries.com\/digistore24-terms\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/pages\/51"}],"collection":[{"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/comments?post=51"}],"version-history":[{"count":2,"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/pages\/51\/revisions"}],"predecessor-version":[{"id":357,"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/pages\/51\/revisions\/357"}],"wp:attachment":[{"href":"https:\/\/www.meticoreindustries.com\/wp-json\/wp\/v2\/media?parent=51"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}